---
kind: other
id: Methods.T:Autodesk.Revit.DB.Form
zh: 对话框、窗口、窗体
source: html/a0a4f571-40fa-881f-977c-6d54a7c0cec9.htm
---
# Form Methods

**中文**: 对话框、窗口、窗体

Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points.